export const DessertMenu = [
  {
    id: 1,
    name:'ふわふわミックスフルーツパンケーキ',
    brandname: 'オリジナルパンケーキハウス 新宿店',
    image:'../images/dessert_01.png',
    body:'フレッシュなミックスフルーツと自家製ストロベリーソースがベストマッチ。'
  },
  {
    id: 2,
    name:'マカロン10個詰合わせ',
    brandname: 'ピエール・エルメ・パリ」',
    image:'../images/dessert_02.png',
    body:'人気の「イスパハン」や、ショウガが引き立てるバナナの斬新な味わい「ジャルダン ド シアム」など季節限定フレーバーを10種詰め合わせました。'
  },
  {
    id: 3,
    name:'ショコリキサー・ミルクチョコレート ',
    brandname: 'GODIVA',
    image:'../images/dessert_03.jpg',
    body:'ゴディバ史上最⼤量の濃厚チョコレートのカカオ％シリーズが新登場。ゴディバが誇る本格チョコレートを楽しめるショコリキサーが、より贅沢に、より味わい深く進化しました。ゴディバ史上最も濃厚で、全⾝に染みわたる、とろけるようなチョコレート体験を。'
  },

  {
    id: 4,
    name:'レモンのティラミス',
    brandname: "qu'il fait bon(キルフェボン)",
    image:'../images/dessert_04.png',
    body:'レモンの酸味とまろやかなマスカルポーネクリーム、相性ぴったりのふたつを合わせたオリジナルティラミスのタルトを作りました。マスカルポーネクリームのなめらかな味わいの中に、レモンのさわやかな香り、タルトに敷いたヘーゼルナッツクリームの香ばしい香りが広がります。'
  },
  {
    id: 5,
    name:'ティラミスアップルパイ',
    brandname: 'GRANNY SMITH APPLE PIE',
    image:'../images/dessert_05.png',
    body:'マスカルポーネの風味にコーヒーの香りが絡む、大人の味わいのティラミスをたっぷりのりんごと合わせて焼き上げた青山限定のシーズナルアップルパイです。'
  },
]