 export const JavaScriptItems =[
  {
    id: 1,
    title:'React開発 現場の教科書',
    category: 'React.js',
    price:3839,
    img: '../images/jsItem-1.jpg',
    body: `JavaScriptライブラリReact + Atomic Designの導入によるコンポーネントの設計から実装まで。
    現場で使える、実務に役立つ知識とノウハウを習得したいエンジニアのための、React実践書です。
    Reactはフロントエンド開発に革新的な影響を与えました。従来のJavaScriptライブラリと比較して、構築へのアプローチが変わり、今後のUI開発に対する大きなヒントとなり得ます。本書はその「今後のUI開発」の視点から、Reactを解説していきます。`
  },
  {
    id: 2,
    title:'Reactビギナーズガイド ―コンポーネントベースのフロントエンド開発入門',
    category: 'React.js',
    price:2750,
    img: '../images/jsItem-2.jpg',
    body: `ReactによるコンポーネントベースのWebフロントエンド開発の入門書。
    Reactでは小さくて管理が容易なコンポーネントを組み合わせて、大きくて強力なアプリケーションを作成できます。
    本書の前半は入門編で、簡単なサンプルを使いながらReactの基本やJSXについて学びます。
    後半は、実際のアプリケーション開発に必要なものや開発を助けてくれるツールについての解説です。`
  },
  {
    id: 3,
    title:'入門 React ―コンポーネントベースのWebフロントエンド開発',
    category: 'React.js',
    price:2860,
    img: '../images/jsItem-3.jpg',
    body: `Facebookが開発したJavaScriptライブラリ「React」の解説書。
    本書では、サンプルアプリケーションを用いてReact.jsのすべての側面を解説します。
    「第I部 基礎」でReactコンポーネントの作成と合成を学び、Reactの基本的な使い方を理解します。
    「第II部 応用」ではワンランク上のコンポーネント作成について学びます。
    「第III部 ツール」ではReactと共に使用して堅牢なアプリケーションを実装するためのツールについて学びます。`
  },
  {
    id: 4,
    title:'React入門 React・Reduxの導入からサーバサイドレンダリングによるUXの向上まで (NEXT ONE)',
    category: 'React.js',
    price:3278,
    img: '../images/jsItem-4.jpg',
    body: `本書はWebアプリケーション開発で、
    人気を博しているReactについて解説した書籍です。
    ReactはFacebookがリリースしたJavaScriptのライブラリで、
    Webアプリケーションをネイティブアプリケーションのように、
    動作させるために開発されました。`
  },
  {
    id: 5,
    title:'作りながら学ぶ React入門',
    category: 'React.js',
    price: 2200,
    img: '../images/jsItem-5.jpg',
    body: `2013年にFacebook社によって公開されたJavaScriptライブラリーがReact(React.js)です。仮想DOMによる高速表示、コンポーネント指向による高いメンテナンス性といった特長からFacebookだけでなく、Instagram、Airbnbなどの大規模Webサービスでも採用されています。本書は、簡単なじゃんけんアプリを作りながら学べるReactの入門書です。開発環境構築も詳述しましたので、JavaScript(ES6)への移行を目指す人にも最適です!`
  },
  {
    id: 6,
    title:'Vue.js入門 基礎から実践アプリケーション開発まで',
    category: 'Vue.js',
    price: 3718,
    img: '../images/jsItem-6.jpg',
    body: `Vue.jsを初歩から実践まで徹底的に解説。
    使いやすくかつ、プロダクションでも活躍するVue.jsをVue.jsコントリビューターの著者らが解説する
    一番わかりやすい入門書です。
    小規模な適用例やjQueryからの移行サンプルに加え、大規模開発を想定したアプリケーション開発も体験できます。
    Vue.jsはGitHubで2017年最も人気のあったJavaScriptフレームワークに選ばれるなど大注目の技術です。`
  },
  {
    id: 7,
    title:'Vue.jsのツボとコツがゼッタイにわかる本 ',
   category: 'Vue.js',
    price: 2970,
    img: '../images/jsItem-7.jpg',
    body: `はじめてVue.jsを学習する人に、Vue.jsの基本的な機能と、ローカルPCでVue.jsを使うための環境設定について解説します。サンプルとして「ECサイトの商品一覧ページ」「ムービー制作サービス自動見積もりページ」をVue.jsを使ったページに作り替えていく流れを解説しています。
    JavaScriptへの苦手意識や挫折経験を乗り越えて、Vue.jsの魅力を体験してみましょう。
    学習に必要な前提知識がなるべく少なくて済むように、JavaScriptのソースコードについては、ES5の構文を敢えて使って解説しています。`
  },
  {
    id: 8,
    title:'改訂2版 基礎から学ぶVue.js',
   category: 'Vue.js',
    price: 3762,
    img: '../images/jsItem-8.jpg',
    body: `Vue.js 2.6に対応して改訂しました。Vue CLI4にも対応しています。
    本書ではVue.jの基礎概念と導入から、プロダクトに役立つ情報までを体系的に解説しています。
    Vue.jsの入門書として最適な1冊です。`
  },
  {
    id: 9,
    title:'これからはじめるVue.js実践入門',
   category: 'Vue.js',
    price: 5483,
    img: '../images/jsItem-9.jpg',
    body: `いま学んでおきたいJavaScriptフレームワーク「Vue.js」のエッセンスを一冊に詰め込みました!
    豊富なサンプルコードで試しながら理解できます!
    
    Vue.js(ビュージェイエス)は、Webアプリのビュー(見た目)の部分に特化したシンプルなフレームワークです。既存のアプリに後乗せで導入したり、徐々に適用範囲を拡大したりすることが手軽に行えます。
    シンプルな分、他のフレームワークと比べて学習コストが低く、HTMLとJavaScriptが一通りわかる人ならコードを理解するのも簡単です。
    
    本書では、Vue.jsの中核である、ページを構成するUI部品「コンポーネント」をしっかりと解説し、さらには本格的なアプリ開発で必要となる要素までを網羅的に取り扱います。丁寧な解説でよくわかる、入門書の決定版です!`
  },
  {
    id: 10,
    title:'みんなのVue.js',
   category: 'Vue.js',
    price: 2508,
    img: '../images/jsItem-10.jpg',
    body: `本書は、日本国内で爆発的な人気を誇るVue.jsの最新ノウハウ・アイデアを1つにまとめた新しい「Vue本」です。アプリケーション開発のためのルーティング・レンダリングから、CSS設計、状態管理、コンポーネント開発、パフォーマンス改善まで、Vue.jsをプロジェクトで使用するうえのさまざまな開発上の観点をまとめつつ、現場のエンジニアによる解決方法をまとめています。
    さらに、Vue.jsコアチームメンバーでもある川口和也(@kazu_pon)氏のインタビューを収録。川口氏が開発するVue18nや、企業に所属しながらのOSS活動についてもたっぷりと語っていただきました。Vue.jsエンジニア必携の1冊です。`
  },
  {
    id: 11,
    title:'動かして学ぶ！Vue.js開発入門 ',
   category: 'Vue.js',
    price: 3520,
    img: '../images/jsItem-11.jpg',
    body: `【Vue.js（ビュージェイエス）とは】
    Vue.jsは、Webアプリ開発用のJavaScriptフレームワークです。
    比較的小規模の開発から利用でき、さらにWebアプリ開発で主流になりつつある、
    シングルページアプリケーション（SPA）を構築することもできるため、
    Web開発で大人気のフレームワークです。
    
    【本書の概要】
    Vue.jsの基本機能を押さえたサンプルを元に、Webアプリ開発手法を学ぶことができます。
    具体的には、ニーズの高い、データバインディング、イベント、ライブラリの利用、コンポーネントなど
    開発の現場でニーズの高いトピックを中心に解説。
    さらに現在、主流になりつつあるSPAの作成に役立つポイントも盛り込みます。`
  },
  {
    id: 12,
    title:'Angularアプリケーションプログラミング',
   category: 'Angular',
    price: 4070,
    img: '../images/jsItem-12.jpg',
    body: `本書は，JavaScriptの定番SPA開発フレームワーク「Angular」の解説書です。データバインディング，コンポーネント，依存性注入といったAngularを理解するための基本要素をはじめ，ディレクティブ／パイプ，フォーム，ルーティング，モジュール／コンポーネントの技術解説，ディレクティブ／パイプ／サービスの自作やテストなどの応用的なテーマまでを網羅。また，Angular 4に対応し，5以降のアップグレードにも留意した解説を行っています。Angularによる動的Webアプリケーション開発に必要となる知識が，この1冊で身に付きます！
    `
  },
  {
    id: 13,
    title:'Angular超入門',
    category: 'Angular',
    price: 3740,
    img: '../images/jsItem-13.jpg',
    body: `Angularは、Googleが中心となって開発する、PWA開発のための強力なフロントエンドフレームワークです。数年前に世に出て以後、猛烈な勢いで進化し、プロの間で高評価を得ています。本書は、Angularを使ってPWA（プログレッシブWebアプリ）開発の基礎と、サービス、通信、ナビゲーションなどの機能を学ぶ入門書です。Angularの基本は意外と簡単です。あなたも最初の一歩を踏み出しましょう。初心者も安心のTypeScript超入門を収録！`
  },
  {
    id: 14,
    title:'Angular Webアプリ開発 スタートブック',
    category: 'Angular',
    price: 3025,
    img: '../images/jsItem-14.jpg',
    body: ``
  },
  {
    id: 15,
    title:'AngularJS　アプリケーションプログラミング',
    category: 'Angular',
    price: 4070,
    img: '../images/jsItem-15.jpg',
    body: `動的Webアプリケーション開発の現場では，FlashやSilverlightを代表とするRIAが衰退し，JavaScriptとHTML5をベースとしたSPAが主流になりつつあります。本書は，Googleが提供する最新JavaScriptフレームワーク「AngularJS」を取り上げ，特徴的な双方向バインディング／DIコンテナー／ルーティングを駆使した開発手法から，ディレクティブ，フィルター，サービス，WebAPI，コントローラーなどの解説，ディレクティブ／フィルター／サービスの自作やテストなどの応用的な技術までを網羅します。AngularJSによるWebアプリケーション開発に必要となる知識が，この1冊で身に付きます。`
  },
  {
    id: 16,
    title:'AngularによるモダンWeb開発　基礎編',
    category: 'Angular',
    price: 3850,
    img: '../images/jsItem-16.jpg',
    body: `初版発行からわずか2年の間にAngularはバージョン2からバージョン7まで進化し国内において大規模な「SPA(Single Page Application)」の開発フレームワークに次々と採用されるようになりました。
    また、Googleが提唱する「PWA(Progressive Web Application)」にバージョン5から対応し、実装手順が簡潔になりました。
    PWAは高速レスポンス、オフライン利用などの機能を実現し、インストールが必要なアプリの置き換えの可能性を秘めています。
    Angularに欠けていた主要機能であるUIライブラリMaterial2もリリースされました。
    改訂版は、これらの変化へ対応して内容を全面的に書き換えました。
    変化の後追いだけでなく、今後を見越したテーマも盛り込んでいます。ブラウザへ分散処理を進めていくと、サーバーに頼らないオフラインの動作、さらに進むとブラウザがサーバーの役割を行い、ほかのユーザーへデータを配信したり、サーバーのデータを更新するようになります。
    ここまで進化すると、ブラウザにもサーバーと同じようにデータベースが必要になります。
    本書では、サーバーとフロントエンドのデバイスが相互にデータ同期を行う分散データベースを実装したサンプルアプリを解説します。`
  },
]